Description: Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.
Identifier: com.github.dan-stefan.recipes.jamf.CiscoWebexMeetings
MinimumVersion: "2.3"

Input:
  NAME: Cisco Webex Meetings
  CATEGORY: Testing
  DOWNLOAD_URL: https://akamaicdn.webex.com/client/webexapp.dmg
  USER_AGENT: Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_5) AppleWebKit/601.2.7 (KHTML, like Gecko) Version/9.0.1 Safari/601.2.7
  GROUP_NAME: "%NAME%-update-smart"
  GROUP_TEMPLATE: JamfSmartGroupTemplate.xml
  TESTING_GROUP_NAME: Testing
  POLICY_CATEGORY: Testing
  POLICY_TEMPLATE: JamfPolicyTemplate.xml
  POLICY_NAME: "Install Latest %NAME%"
  SELF_SERVICE_DISPLAY_NAME: "Install Latest %NAME%"
  SELF_SERVICE_DESCRIPTION: latest version of Cisco Webex Meetings
  SELF_SERVICE_ICON: "%NAME%.png"
  UPDATE_PREDICATE: "pkg_uploaded == False"

Process:

  - Processor: URLDownloader
    Arguments:
      url: "%DOWNLOAD_URL%"
      filename: "%NAME%.dmg" 
   
  - Processor: EndOfCheckPhase
  
  - Processor: CodeSignatureVerifier
    Arguments:
      input_path: "%pathname%/Cisco Webex Meetings.app"
      requirement: identifier "com.cisco.webex.Cisco Webex Meetings"
  
  - Processor: AppDmgVersioner
    Arguments:
      dmg_path: "%pathname%"

  - Processor: PkgRootCreator
    Arguments:
      pkgdirs: 
        Applications: '0775'
      pkgroot: "%RECIPE_CACHE_DIR%/%NAME%"
  
  - Processor: Copier
    Arguments:
      destination_path: "%pkgroot%/Applications/%app_name%"
      source_path: "%pathname%/%app_name%"
      
  - Processor: PkgCreator
    Arguments:
      pkg_request: 
        chown:
          - group: admin
            path: Applications
            user: root
        id: "%bundleid%"
        options: purge_ds_store
        pkgname: "%NAME%-%version%"
        version: "%version%"
        
  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPackageUploader
    Arguments:
      pkg_category: "%CATEGORY%"
      prod_name: "%NAME%"
      pkg_path: "%pkg_path%"

  - Processor: StopProcessingIf
    Arguments:
      predicate: "%UPDATE_PREDICATE%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfComputerGroupUploader
    Arguments:
      computergroup_template: "%GROUP_TEMPLATE%"
      computergroup_name: "%GROUP_NAME%"

  - Processor: com.github.grahampugh.jamf-upload.processors/JamfPolicyUploader
    Arguments:
      policy_template: "%POLICY_TEMPLATE%"
      policy_name: "%POLICY_NAME%"
      icon: "%SELF_SERVICE_ICON%"
