<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version PyCharm.</string>
    <key>Identifier</key>
    <string>com.github.dan-stefan.download.pycharm</string>
    <key>CATEGORY</key>
    <string>Testing</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>PyCharm CE</string>
	<key>CATEGORY</key>
    	<string>Testing</string>
        <key>SEARCH_URL</key>
        <string>https://data.services.jetbrains.com/products/releases?code=PCC</string>
        <key>SEARCH_PATTERN</key>
        <string>mac":{"link":"([^,]*?20\d{2,2}(.\d{1,4}){1,3}.dmg)"</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.1</string>
    <key>Process</key>
    <array>
       <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%SEARCH_URL%</string>
                <key>re_pattern</key>
                <string>%SEARCH_PATTERN%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/PyCharm CE.app</string>
                <key>requirement</key>
                <string>identifier "com.jetbrains.pycharm" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3"</string>
            </dict>
        </dict>
        <dict>
			    <key>Arguments</key>
			    <dict>
			    	<key>dmg_path</key>
			    	<string>%pathname%</string>
		    	</dict>
			      <key>Processor</key>
			      <string>AppDmgVersioner</string>
		    </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkgdirs</key>
				<dict>
					<key>Applications</key>
					<string>0775</string>
				</dict>
				<key>pkgroot</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%</string>
			</dict>
			<key>Processor</key>
			<string>PkgRootCreator</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%pkgroot%/Applications/%app_name%</string>
				<key>source_path</key>
				<string>%pathname%/%app_name%</string>
			</dict>
			<key>Processor</key>
			<string>Copier</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_request</key>
				<dict>
					<key>chown</key>
					<array>
						<dict>
							<key>group</key>
							<string>admin</string>
							<key>path</key>
							<string>Applications</string>
							<key>user</key>
							<string>root</string>
						</dict>
					</array>
					<key>id</key>
					<string>%bundleid%</string>
					<key>options</key>
					<string>purge_ds_store</string>
					<key>pkgname</key>
					<string>%NAME%-%version%</string>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>PkgCreator</string>
		</dict>
		<dict>
            		<key>Arguments</key>
            		<dict>
                		<key>pkg_category</key>
               			<string>%CATEGORY%</string>
                		<key>prod_name</key>
                		<string>%NAME%</string>
                		<key>pkg_path</key>
                		<string>%pkg_path%</string>
            		</dict>
            		<key>Processor</key>
    			<string>com.github.grahampugh.jamf-upload.processors/JamfPackageUploader</string>
        	</dict>
    </array>
</dict>
</plist>
