<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	  <string>Downloads the latest version and makes a pkg. Then, uploads the package to the Jamf Pro Server and creates a Self Service Policy and Smart Group.</string>
    <key>Identifier</key>
	  <string>com.github.dan-stefan.PyCharmCE</string>
    <key>ParentRecipe</key>
	  <string>com.github.autopkg.pkg.AdobeAIR</string>
    
</dict>
</plist>
